Revit 2024 API
Group.IsCompatibleAttachedDetailGroupType Method
 Checks if the orientation of the input attached detail group matches the input view's orientation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019.1
Syntax
C#
public bool IsCompatibleAttachedDetailGroupType(
	View view,
	ElementId detailGroupTypeId
)
Visual Basic
Public Function IsCompatibleAttachedDetailGroupType ( _
	view As View, _
	detailGroupTypeId As ElementId _
) As Boolean
Visual C++
public:
bool IsCompatibleAttachedDetailGroupType(
	View^ view,
	ElementId^ detailGroupTypeId
)
Parameters
view
Type: Autodesk.Revit.DB.View
 The view that the input attached detail group must be compatible with.
detailGroupTypeId
Type: Autodesk.Revit.DB.ElementId
 The attached detail group that will be checked for compatibility with the input view.
Return Value
 Returns true if the input attached detail group is compatible with the input view and false otherwise.
Remarks
 Currently, detail groups in perpendicular elevation views (for example, North and East views) are considered compatible. When showing these detail groups, an error (FailureMessage) based on id can be generated if the orientation of the annotations do not match the orientation of the target view (for example, the failure definition DimensionPerpendicularToView). To prevent displaying detail groups in the wrong view, you can check the OwnerViewId of a detail group to make sure it matches the view in which you are trying to display it.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The input group is not a model group and can therefore not have attached detail groups.
See Also
Group Class
Autodesk.Revit.DB Namespace